#include <stdio.h>
#include <stdlib.h>
#include <locale.h>
#include <math.h>

void main()
{
	setlocale(LC_ALL, "Rus");

	int n = 0;

	printf("Введите номер задания:\t");
	scanf("%d", &n);

	if (n == 1)
	{

		//   1.	Известно, что X кг конфет стоит A рублей. Определить, сколько стоит 1 кг и Y кг этих же конфет.

		int x = 0, a = 0;

		printf("Введите массу конфет в кг.:\t");
		scanf("%d", &x);

		printf("Введите стоимость в рублях:\t");
		scanf("%d", &a);

		int k = 0, y = 0;

		k = a / x;
		y = 5 * k;
		printf("1 кг конфет стоит = %d и 5 кг. конфет стоит = %d\n", k, y);



	}

	else if (n == 2)
	{

		// 2.Решить линейное уравнение A·x + B = 0, заданное своими коэффициентами A и B(коэффициент A не равен 0).

		float A = 0, B = 0, X = 0;
		printf("Введите значение А:");
		scanf("%f", &A);
		if (A == 0)
		{
			printf("А не может быть равно нулю\n");
		}
		else
		{
			printf("Введите значение В:");
			scanf("%f", &B);

			X = (-B / A);

			printf("Значение линейного уравнения = %f\n", X);

		}
	}

	else if (n == 3)
	{


		//3. С начала суток прошло N секунд (N — целое). Найти количество полных минут, прошедших с начала суток.

		int N = 0, M = 0;

		printf("Введите сколько прошло секунд:\t");
		scanf("%d", &N);

		M = N / 60;
		printf("Количество полных минут = %d\n", M);
	}



	else if (n == 4)
	{

		//4.	Скорость первого автомобиля V1 км/ч, второго — V2 км/ч, расстояние между ними S км. 
		//Определить расстояние между ними через T часов, если автомобили первоначально движутся навстречу друг другу. 
		//Данное расстояние равно модулю разности начального расстояния и общего пути, проделанного автомобилями; общий путь = время · суммарная скорость.

		int V1 = 0, V2 = 0, T = 0, S1 = 0;

		printf("Введите скорость  первого автомобиля:\t");
		scanf("%d", &V1);

		printf("Введите скорость  второго автомобиля:\t");
		scanf("%d", &V2);

		printf("Введите время:\t");
		scanf("%d", &T);

		printf("Введите начальное расстояние между ними:\t");
		scanf("%d", &S1);

		int S2 = 0;

		S2 = S1 - (T*(V1 + V2));
		printf("Расстояние между автомобилями через Т часов= %d\n", abs(S2));



	}

	else if (n == 5)
	{

		//5.	Даны длины сторон прямоугольного параллелепипеда. Найти его объем и площадь боковой поверхности
		int a = 0, b = 0, c = 0;
		printf("Введите сторону а прямоугольного параллелепипеда:\t");
		scanf("%d", &a);

		printf("Введите сторону b прямоугольного параллелепипеда:\t");
		scanf("%d", &b);

		printf("Введите сторону c прямоугольного параллелепипеда:\t");
		scanf("%d", &c);

		int V = 0;

		V = a*b*c;
		printf("Объем боковой повеврхности = %d\n", V);

		int S = 0;
		S = 2 * ((a*b) + (b*c) + (a*c));
		printf("Площадь боковой повеврхности = %d\n", S);
	}

	else if (n == 6)
	{
		//6.	Известны координаты на плоскости двух точек. Составить программу вычисления расстояния между ними.

		int x1 = 0, x2 = 0, y1 = 0, y2 = 0;
		printf("Введите координаты x1 точки:\t");
		scanf("%d", &x1);

		printf("Введите координаты x2 точки:\t");
		scanf("%d", &x2);
		
		printf("Введите координаты y1 точки:\t");
		scanf("%d", &y1);

		printf("Введите координаты y2 точки:\t");
		scanf("%d", &y2);

		int d = 0;
		d = sqrt(sqrt(x2 - x1) + sqrt(y2 - y1));

		printf("Расстояние между ними = %d\n", d);

	}
	
	else if (n==7)
	{

		//7.	Известны объем и масса тела. Определить плотность материала этого тела.

		int V = 0, m = 0;

		printf("Введите обьем тела:\t");
		scanf("%d", &V);

		printf("Введите массу тела:\t");
		scanf("%d", &m);

		int P = 0;
		P = m / V;

		printf("Плотность материала = %d\n", P);


	}

	else if (n==8)
	{
		//8.	Составить программу:
		//a.вычисления значения функции z = x3 – 2.5xy + 1.87x2 + 1 при любых значениях х и y;
		//b.вычисления значения функции x = 3.56 a + b3 - 5.8b2 + 3.8a - 1.5 при любых значениях a и b.

		int x = 0, y = 0, a = 0, b = 0;
		
		printf("Введите значение х:\t");
		scanf("%d", &x);

		printf("Введите значение y:\t");
		scanf("%d", &y);

		printf("Введите значение a:\t");
		scanf("%d", &a);

		printf("Введите значение b:\t");
		scanf("%d", &b);


		float z = 0, r = 0;

		z = (x*x*x) - 2.5*x*y + 1.87*(x*x) + 1;
		printf("Значение функции z = %f\n", z);

		r = 3.56*a + (b*b*b) - 5.8*(b*b) + 3.8*a - 1.5;
		printf("Значение функции r = %f\n", r);
	}
	
	else if (n==9)
	{
		//9.	Дана сторона квадрата. Найти его периметр

		int a = 0;
		printf("Введите сторону квадрата:\t");
		scanf("%d", &a);

		int P = 0;
		P = 4 * a;

		printf("Периметр квадрата = %d\n",P);
		
	}
	else if (n==10)
	{
		//10.	Дан радиус окружности. Найти ее диаметр.

		int R = 0;
		printf("Введите радиус окружности:\t");
		scanf("%d", &R);

		int D = 0;
		D = 2*R;

		printf("Диаметр окружности = %d\n", D);


	}
	else
	{
		printf("Такого задания нет, введите другое\n");

	}
 	

	
}