#include <stdio.h>
#include <stdlib.h>
#include <locale.h>


void main()
{
	setlocale(LC_ALL, "Rus");

	int n = 0;

	printf("Введите номер задания:\t");
	scanf("%d", &n);

	if (n == 1)
	{

		//   1.	Известно, что X кг конфет стоит A рублей. Определить, сколько стоит 1 кг и Y кг этих же конфет.

		int x = 0, a = 0;

		printf("Введите массу конфет в кг.:\t");
		scanf("%d", &x);

		printf("Введите стоимость в рублях:\t");
		scanf("%d", &a);

		int k = 0, y = 0;

		k = a / x;
		y = 5 * k;
		printf("1 кг конфет стоит = %d и 5 кг. конфет стоит = %d\n", k, y);



	}

	else if (n == 2)
	{

		// 2.Решить линейное уравнение A·x + B = 0, заданное своими коэффициентами A и B(коэффициент A не равен 0).

		float A = 0, B = 0, X = 0;
		printf("Введите значение А:");
		scanf("%f", &A);
		if (A == 0)
		{
			printf("А не может быть равно нулю\n");
		}
		else
		{
			printf("Введите значение В:");
			scanf("%f", &B);

			X = (-B / A);

			printf("Значение линейного уравнения = %f\n", X);

		}
	}

	else if (n == 3)
	{


		//3. С начала суток прошло N секунд (N — целое). Найти количество полных минут, прошедших с начала суток.

		int N = 0, M = 0;

		printf("Введите сколько прошло секунд:\t");
		scanf("%d", &N);

		M = N / 60;
		printf("Количество полных минут = %d\n", M);
	}



	else if (n == 4)
	{

		//4.	Скорость первого автомобиля V1 км/ч, второго — V2 км/ч, расстояние между ними S км. 
		//Определить расстояние между ними через T часов, если автомобили первоначально движутся навстречу друг другу. 
		//Данное расстояние равно модулю разности начального расстояния и общего пути, проделанного автомобилями; общий путь = время · суммарная скорость.

		int V1 = 0, V2 = 0, T=0, S1=0;

		printf("Введите скорость  первого автомобиля:\t");
		scanf("%d", &V1);
		
		printf("Введите скорость  второго автомобиля:\t");
		scanf("%d", &V2);
		
		printf("Введите время:\t");
		scanf("%d", &T);
		
		printf("Введите начальное расстояние между ними:\t");
		scanf("%d", &S1);
		
		int S2 = 0;

		S2 = S1- (T*(V1 + V2));
		printf("Расстояние между автомобилями через Т часов= %d\n", abs (S2));

		

	}

	else if (n==5)
	{

		//5.	Даны длины сторон прямоугольного параллелепипеда. Найти его объем и площадь боковой поверхности
		int a = 0, b = 0, c = 0;
		printf("Введите сторону а прямоугольного параллелепипеда:\t");
		scanf("%d", a);

		printf("Введите сторону b прямоугольного параллелепипеда:\t");
		scanf("%d", b);

		printf("Введите сторону c прямоугольного параллелепипеда:\t");
		scanf("%d", c);

		int V = 0, S = 0;

		V = a*b*c;
		S = 2 * (a*b + b*c + a*c);

		printf("Объем боковой повеврхности = %d\n", V);
		printf("Площадь боковой повеврхности = %d\n", S);
	}

	else
	{

	}

}